---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerSize
source: html/eccb6b23-6fb1-7f9f-eea9-270cccd44f6a.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings.MarkerSize Property

Size of marker.

## Syntax (C#)
```csharp
public double MarkerSize { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: markerSize is negative